import React from 'react';
import './style.css'; // Не забудьте створити та імпортувати CSS файл для стилів
import Navbar from '../NavBar/NavBar';
function DevelopOfLogicThink() {
  return (
    <><Navbar /><div className="container_dev">
          <h1>Уміння логічно мислити — незамінне</h1>
          <h2>Як розвинути логічне мислення: поради, вправи та задачі</h2>
          <p>Побутує думка, що логіка властива тільки тим, в кого так званий «математичний склад розуму», а от «гуманітарії» з логікою не дружать. Проте це абсолютно не так. Логічне мислення може розвинути та вдосконалювати будь-хто.</p>
          <p>Людина, яка здатна мислити логічно, може на підставі наявної у неї інформації (нехай навіть розрізненої і неточної), зробити правильний висновок і таким чином докопатися до істини.</p>

          <p>Вміючи логічно мислити, ми можемо:</p>
          <ul>
              <li>знайти найбільш простий і безпечний вихід з проблемної ситуації;</li>
              <li>уникати як професійних, так і життєвих помилок;</li>
              <li>бути на крок попереду ваших недоброзичливців і конкурентів, яких Бог обділив логікою;</li>
              <li>грамотно викладати свої думки, так, щоб їх зрозуміли всі навколишні;</li>
              <li>швидко формулювати думку, щоб не тягнути з відповіддю на поставлене запитання і не сказати якусь нісенітницю, яка прийшла в голову;</li>
              <li>не стати жертвою самообману і обману з боку інших людей;</li>
              <li>легко знаходити аргументи, щоб доводити до співрозмовників власну точку зору і схиляти їх на свій бік;</li>
              <li>бачити помилки, які допускаєте ви або оточуючі вас люди і швидко їх усувати.</li>
          </ul>

          <h2>Ігри, які допоможуть розвинути логіку</h2>
          <p>Існує ряд ігор, в які повинні грати і дорослі, і діти, якщо вони хочуть розвинути свою логіку і вдосконалити логічне мислення. Ось кілька із них:</p>
          <ol>
              <li>Шахи. Все просто: або ви навчитеся логічно мислити, або до кінця днів своїх ви будете програвати в шахи.</li>
              <li>Шашки. Ця гра трохи простіша, ніж шахи, але теж непогано допомагає розвивати логічне мислення. З неї можна й почати.</li>
              <li>Нарди. Ще одна знайома багатьом з дитинства гра, яка розвиває логіку.</li>
              <li>Ребуси, сканворди, головоломки. Навіть банальні кросворди підходять для того, щоб розвивати інтелект і логіку.</li>
              <li>Монополія. Справжній дух суперництва та розробка бізнес-стратегії.</li>
              <li>П’ятнашки. Вам потрібно скласти по порядку цифри, які перебувають в хаосі, маючи можливість пересувати їх тільки вгору та вниз, вправо-вліво. Вдосконалившись, можна робити це завдання на час.</li>
              <li>Скреббл. Гра працює за принципом кросворду, тільки слова складаються на ігровому полі, а у вас є обмежена кількість букв, які ви можете додати на табло.</li>
          </ol>

          <h2>Вправи, виконання яких допоможе розвинути логіку</h2>
          <p>Якщо ви серйозно вирішили підійти до вдосконалення свого логічного мислення, то одними іграми не обійтися. Доведеться виконувати щодня хоча б одне, а краще — кілька вправ з цього списку:</p>
          <ul>
              <li>Розгадування анаграм. З букв, перемішаних в довільному порядку, вам необхідно скласти нормальне слово.</li>
              <li>Вирішення спеціальних логічних задачок. І в інтернеті, і в книжкових магазинах продається чимало збірників з такими завданнями.</li>
              <li>Складання кросвордів або головоломок.</li>
              <li>Придумайте 5 способів використання будь-якого предмета або ж знайдіть 5 виходів з якоїсь ситуації.</li>
          </ul>

          <p>Якщо ви лінуєтеся щодня виконувати вправи і не є безнадійною людиною в плані логічного мислення, то розвивати логіку можна простими способами, непомітно навіть для самого себе:</p>
          <ul>
              <li>Читанням детективів. Чим більше детективної літератури ви читаєте, тим більше ви будете розуміти логіку дій фахівців, що розслідують злочини.</li>
              <li>Виконуючи якусь дію. Хоч іноді пояснюйте собі: для чого ви це робите, що буде, якщо ви цього не зробите, яким буде результат, якщо ви помилитеся і т.д.</li>
              <li>Навчіться писати і виконувати інші дії лівою рукою, якщо ви правша і правою — якщо лівша. Так ви активізуєте роботу обох півкуль мозку.</li>
              <li>Візьміть за звичку щодня проводити на свіжому повітрі не менше години. Так ви будете сприяти розвитку не тільки логічного, а й інших видів мислення.</li>
              <li>Не виконуйте одну дію довше, ніж 1 годину, постійно міняйте види діяльності. Це допоможе тримати ваш мозок в тонусі і розвивати логічне мислення.</li>
          </ul>

          <p>Якщо ви цікавитеся, як розвинути логіку, значить, розумієте, що без неї вам не прожити. А оскільки розумієте, що вам це необхідно, то, думаю, не будете лінуватися тренувати своє логічне мислення.</p>

          <h2>Усні обчислення необхідні людині в житті</h2>
          <p>Навичка швидкої усної лічби - це мінімальний рівень математичної культури. Треновані люди, що займаються її підвищенням і вдосконаленням, відрізняються більш високою швидкістю розумових процесів. Вони вміють сконцентруватися, вільно ведуть діалог з менеджером банку, безпомилково здійснюють підрахунки в магазині, вміють миттєво ухвалювати рішення.</p>
          <p>Швидку усну лічбу необхідно тренувати. Відточувати навички, закладати основи, що сприяють швидкому усному обчисленню, рекомендується в ранньому дитинстві. Для цього придумані різні вправи, методики, розвивальні заняття, розроблені ігри та програми для мобільних пристроїв. Тому батьки повинні знати, як навчити дитину рахувати.</p>

          <h3>Тренування для швидкої усної лічби</h3>

          <h4>Хитрощі швидкої лічби подумки</h4>
          <p>Існують прийоми швидкої усної лічби. Розуміння складу числа, вміння розкладати його на складові для здійснення більш простих операцій є потужними прискорювальниками усного рахунку. Розглянемо декілька прикладів:</p>
          <ul>
              <li>Потрібно відняти 7 від 25. У стандартному варіанті від'ємник віднімається від числа десятків, до результату додаються одиниці зменшуваного. При такому підході у школярів виникають труднощі з запам'ятовуванням проміжного результату. Простіше буває зробити такі дії: 25-10 + 3, тобто розкласти від'ємник на кілька зручних складових. Якщо виконувати хоча б 10 прикладів щодня, результат не змусить себе чекати.</li>
              <li>Швидке множення на 4, 8, 16. Такі обчислення не є складними для школярів, які твердо знають таблицю множення. Але впоратися можна і без неї, якщо зрозуміти, що подвоювати числа швидше і простіше, ніж множити на 4, просто цю операцію потрібно повторити двічі.</li>
              <li>Замість поділу числа на 5 можна застосовувати множення на 10 і ділення на 2, що набагато легше.</li>
          </ul>
          <p>Знання «хитрощів» усної лічби дозволяє подолати перешкоди в навчанні, підвищити швидкість обчислень.</p>

          <h4>Додавання чисел подумки</h4>
          <p>Щоб навчитися складати подумки великі числа, потрібно вміти безпомилково додавати числа до 10. У кінці будь-яка складна задача зводиться до виконання кількох тривіальних дій.</p>
          <p>Наприклад, додаймо числа 8 і 6. Щоб з 8 отримати 10, не вистачає 2. Потім до 10 залишиться додати 4 = 6-2. В результаті отримуємо: 8 + 6 = (8 + 2) + 4 = 10 + 4 = 14.</p>
          <p>Основна хитрість зі складанням великих чисел - розбити їх на розрядні частини, а потім скласти ці частини між собою.</p>
          <p>Нехай нам потрібно додати два числа: 356 і 728. Число 356 можна уявити як 300 + 50 + 6. Аналогічно, 728 матиме вигляд 700 + 20 + 8. Тепер складаємо:</p>
          <pre>
              356 + 728 = (300 + 700) + (50 + 20) + (8 + 6) = 1000 + 70 + 14 = 1084
          </pre>

          <h4>Віднімання чисел</h4>
          <p>Віднімання чисел теж буде даватися легко. Але на відміну від складання, де кожне число розбивається на розрядні частини, при відніманні «розбити» потрібно тільки те число, яке ми віднімаємо.</p>
          <p>Наприклад, скільки буде 528-321? Розбиваємо число 321 на розрядні частини і отримуємо: 321 = 300 + 20 + 1.</p>
          <p>Тепер рахуємо:</p>
          <pre>
              528 - 300 - 20 - 1 = 228 - 20 - 1 = 208 - 1 = 207
          </pre>

          <h4>Множення чисел подумки</h4>
          <p>Множення - це багаторазове повторення числа. Якщо потрібно помножити 8 на 4, це означає, що число 8 потрібно повторити 4 рази.</p>
          <pre>
              8 * 4 = 8 + 8 + 8 + 8 = 32
          </pre>
          <p>Оскільки всі складні завдання зводяться до простіших, потрібно вміти множити всі однозначні числа. Для цього існує чудовий інструмент - таблиця множення. Якщо ваша дитина не знає цю таблицю на зубок, то слід насамперед вивчити її, і лише потім братися за практику усної лічби.</p>

          <h4>Ділення чисел</h4>
          <p>Залишилося розібратися з діленням. По суті, це операція, протилежна множенню. З діленням чисел до 100 жодних проблем взагалі виникати не повинно - адже є таблиця множення, яка допоможе в цьому вашій дитині.</p>
          <p>При діленні багатозначних чисел на однозначне необхідно виділити максимально більшу частину, яку можна поділити за допомогою таблиці множення.</p>
          <p>Наприклад, є число 6144, яке потрібно розділити на 8. Згадуємо таблицю множення і розуміємо, що на 8 буде ділитися число 5600. Уявімо приклад у вигляді:</p>
          <pre>
              6144 : 8 = (5600 + 544) : 8 = 700 + 544 : 8
          </pre>
          <p>Далі з числа 544 також виділяємо максимально велике число, яке ділиться на 8. Маємо:</p>
          <pre>
              544 : 8 = (480 + 64) : 8 = 60 + 64 : 8
          </pre>
          <p>Залишилося поділити 64 на 8 і отримати результат, додавши всі результати ділення:</p>
          <pre>
              64 : 8 = 8
          </pre>
          <pre>
              6144 : 8 = 700 + 60 + 8 = 768
          </pre>

          <h3>Найцікавіші прийоми</h3>
          <p>Швидкий спосіб навчитися усній лічбі подумки - це дізнатися деякі хитрі методи, які допоможуть рахувати майже моментально. Ось деякі способи:</p>
          <ul>
              <li>Щоб помножити будь-яке однозначне число на 9, покажемо всім свої порожні долоні. Загнемо палець, відповідний по порядку (рахуючи від великого пальця лівої руки) числу першого співмножника. Дивимося, скільки пальців зліва від загнутого - це будуть десятки шуканого числа, а праворуч - його ж одиниці.</li>
              <li>Множення на 11 будь-якого двозначного числа, сума цифр якого не досягає 10, здійснюється весело і просто: подумки розсунемо цифри цього числа і поставимо між ними їхню суму - відповідь готова.</li>
              <li>У разі, якщо сума цифр множника на 11 числа дорівнює 10-ти або більше 10-ти, то між подумки розсунутими цифрами цього числа слід поставити їхню суму і скласти перші дві цифри зліва, залишивши дві інші без зміни, - отримали відповідь.</li>
          </ul>

          <h3>Розвиток пам'яті і швидкості читання</h3>
          <p>Для досягнення аналогічних результатів необов'язково тренуватися на арифметичних прикладах. Для розвитку мозкової діяльності важливі щоденні навантаження, засвоєння нових потоків інформації, джерелом якої є книги.</p>
          <p>Читання покращує здатність до концентрації, розвиває пам'ять. Можна підвищити швидкість цього процесу, пройшовши спеціальний курс. У програмі - вправи, адаптовані для слухачів різного віку - середніх школярів, підлітків, дорослих людей. У процесі навчання осягаються спеціальні техніки, серед яких потім вибирається та, що найкраще підходить для конкретної людини.</p>
          <p>Збільшити обсяг інформації, що запам'ятовується, дозволяють заняття Меморикою в ​​«Академії розвитку інтелекту SMARTUM». Обсяг пам'яті та швидкість розумових процесів, в тому числі обчислень, безпосередньо пов'язані. Особливо корисні такі заняття школярам, яких лякають іспити, контрольні роботи, дітям, які витрачають багато часу на підготовку домашніх завдань.</p>
          <p>Вибір методики тренування швидкої лічби подумки - питання індивідуальне. Важливо поставити перед собою мету, досягти позитивних результатів, вийти за жорсткі рамки певного рівня, щоб отримати владу над числами, таку необхідну в повсякденному житті.</p>
      </div></>
)};

  export default DevelopOfLogicThink;
